minhtue123/Nong_Nghiep_Thong_Minh/firmware/VisionBot_ESP32CAM/VisionBot_ESP32CAM.ino
/*
  VisionBot ESP32-CAM Firmware v1.0 Production-Oriented
  ------------------------------------------------------
  Features:
    - Config portal displays device_id
    - No hard-coded Wi-Fi credentials
    - MQTT control/status/telemetry
    - WebSocket camera stream on port 86
    - Dynamic IP announce via MQTT state
    - Motor watchdog / command TTL
    - State + telemetry + basic security events

  Hardware mapping inherited from current tested baseline:
    L298N IN1 -> GPIO12
    L298N IN2 -> GPIO13
    L298N IN3 -> GPIO14
    L298N IN4 -> GPIO15
    Servo signal -> GPIO2

  Required Arduino libraries:
    - WiFiManager by tzapu
    - PubSubClient by Nick O'Leary
    - WebSockets by Markus Sattler
    - ArduinoJson by Benoit Blanchon
    - esp32-camera / ESP32 board package

  Demo note:
    This build targets a portable LAN demo. Set Windows Mobile Hotspot to:
      SSID: ThinhVip
      Password: Thinh123
    Windows hotspot normally gives the laptop IP 192.168.137.1.
    ESP uses external MQTT port 1884, mapped by Docker to broker port 1883.
*/

#include <Arduino.h>
#include <WiFi.h>
#include <WiFiClient.h>
#include <WebServer.h>
#include <WebSocketsServer.h>
#include <PubSubClient.h>
#include <WiFiManager.h>
#include <Preferences.h>
#include <ArduinoJson.h>
#include <esp_camera.h>
#include <esp_system.h>
#include <time.h>

#if __has_include("esp_arduino_version.h")
#include "esp_arduino_version.h"
#endif

#ifndef ESP_ARDUINO_VERSION_MAJOR
#define ESP_ARDUINO_VERSION_MAJOR 2
#endif

// ================= FIRMWARE =================
#define FW_NAME    "visionbot-esp32cam"
#define FW_VERSION "1.2.2-thinhvip-hotspot-port1884"

// ================= PORTABLE LAN DEMO DEFAULTS =================
// Set Windows Mobile Hotspot to these exact values for a no-portal demo.
// If the hotspot is unavailable, firmware falls back to the WiFiManager portal.
#define VISIONBOT_DEMO_WIFI_ENABLE 1
#define VISIONBOT_DEMO_WIFI_SSID "ThinhVip"
#define VISIONBOT_DEMO_WIFI_PASS "Thinh123"
#define VISIONBOT_DEMO_MQTT_HOST "192.168.137.1"
#define VISIONBOT_DEMO_MQTT_PORT 1884

// ================= CAMERA MODEL: AI THINKER =================
#define PWDN_GPIO_NUM     32
#define RESET_GPIO_NUM    -1
#define XCLK_GPIO_NUM      0
#define SIOD_GPIO_NUM     26
#define SIOC_GPIO_NUM     27

#define Y9_GPIO_NUM       35
#define Y8_GPIO_NUM       34
#define Y7_GPIO_NUM       39
#define Y6_GPIO_NUM       36
#define Y5_GPIO_NUM       21
#define Y4_GPIO_NUM       19
#define Y3_GPIO_NUM       18
#define Y2_GPIO_NUM        5
#define VSYNC_GPIO_NUM    25
#define HREF_GPIO_NUM     23
#define PCLK_GPIO_NUM     22

// ================= PIN MAPPING =================
#define IN1 12
#define IN2 13
#define IN3 14
#define IN4 15

#define SERVO_PIN 2

// ================= SERVO PWM =================
#define SERVO_CH   4
#define SERVO_FREQ 50
#define SERVO_RES  16

// ================= SERVICES =================
WebServer httpServer(80);
WebSocketsServer cameraWs = WebSocketsServer(86);
Preferences prefs;
WiFiClient mqttNetClient;
PubSubClient mqttClient(mqttNetClient);

// ================= DEVICE CONFIG =================
struct DeviceConfig {
  String robotId;
  String baseTopic;
  String mqttHost;
  uint16_t mqttPort;
  String mqttUser;
  String mqttPass;
  uint32_t telemetryIntervalMs;
};

DeviceConfig cfg;

// ================= DEVICE RUNTIME =================
String deviceId;
String setupApSsid;
String setupApPass;

bool cameraReady = false;
uint8_t cameraClientCount = 0;
unsigned long lastFrameMs = 0;
const unsigned long FRAME_INTERVAL_MS = 33;  // ~30 FPS target
const uint32_t CAMERA_XCLK_HZ = 15000000;    // XCLK 15 MHz: smoother in current OV3660 test
const framesize_t CAMERA_FRAME_SIZE_PSRAM = FRAMESIZE_QVGA;    // 320x240
const framesize_t CAMERA_FRAME_SIZE_NO_PSRAM = FRAMESIZE_QQVGA; // 160x120 fallback
const int CAMERA_JPEG_QUALITY_PSRAM = 22;    // Higher number = smaller/lower quality JPEG
const int CAMERA_JPEG_QUALITY_NO_PSRAM = 26;

bool mqttEverConnected = false;
unsigned long lastMqttAttemptMs = 0;
unsigned long mqttReconnectDelayMs = 1000;
const unsigned long MQTT_RECONNECT_MAX_MS = 8000;

uint8_t mqttConsecutiveFailures = 0;
const uint8_t MQTT_AUTO_PORTAL_FAIL_COUNT = 3;

unsigned long wifiDisconnectedSinceMs = 0;
const unsigned long WIFI_AUTO_PORTAL_AFTER_MS = 45000;

unsigned long lastTelemetryMs = 0;
unsigned long lastStateMs = 0;
const unsigned long STATE_INTERVAL_MS = 30000;

unsigned long bootMs = 0;
uint32_t securityEventCount = 0;
String lastSecurityEvent = "boot";

// ================= CONTROL STATE =================
enum RobotMode {
  MODE_IDLE,
  MODE_MANUAL,
  MODE_AI,
  MODE_ESTOP
};

RobotMode currentMode = MODE_IDLE;

unsigned long lastMotorCommandMs = 0;
unsigned long currentCommandTtlMs = 700;
bool motorActive = false;
String motorState = "stop";
int servoAngle = 90;
uint32_t lastCmdSeq = 0;
String lastCmdAckStatus = "none";
String lastCmdAckDetail = "none";

// ================= HELPERS =================
String jsonEscape(const String &s) {
  String out = "";
  out.reserve(s.length() + 8);
  for (size_t i = 0; i < s.length(); i++) {
    char c = s[i];
    if (c == '\"') out += "\\\"";
    else if (c == '\\') out += "\\\\";
    else if (c == '\n') out += "\\n";
    else if (c == '\r') out += "\\r";
    else if (c == '\t') out += "\\t";
    else out += c;
  }
  return out;
}

String q(const String &s) {
  return "\"" + jsonEscape(s) + "\"";
}

String boolStr(bool v) {
  return v ? "true" : "false";
}

String modeToString() {
  switch (currentMode) {
    case MODE_IDLE: return "idle";
    case MODE_MANUAL: return "manual";
    case MODE_AI: return "ai";
    case MODE_ESTOP: return "estop";
    default: return "unknown";
  }
}

void setModeFromString(const String &mode) {
  if (mode == "idle") currentMode = MODE_IDLE;
  else if (mode == "manual") currentMode = MODE_MANUAL;
  else if (mode == "ai") currentMode = MODE_AI;
  else if (mode == "estop") currentMode = MODE_ESTOP;
}

String resetReasonToString() {
  esp_reset_reason_t r = esp_reset_reason();
  switch (r) {
    case ESP_RST_POWERON: return "poweron";
    case ESP_RST_EXT: return "external";
    case ESP_RST_SW: return "software";
    case ESP_RST_PANIC: return "panic";
    case ESP_RST_INT_WDT: return "interrupt_watchdog";
    case ESP_RST_TASK_WDT: return "task_watchdog";
    case ESP_RST_WDT: return "other_watchdog";
    case ESP_RST_DEEPSLEEP: return "deepsleep";
    case ESP_RST_BROWNOUT: return "brownout";
    case ESP_RST_SDIO: return "sdio";
    default: return "unknown";
  }
}

String getIpString() {
  if (WiFi.status() == WL_CONNECTED) return WiFi.localIP().toString();
  return "0.0.0.0";
}

