minhtue123/Nong_Nghiep_Thong_Minh/firmware/VisionBot_ESP32CAM/VisionBot_ESP32CAM.ino
void clearRecoveryPortalReason() {
  prefs.begin("visionbot", false);
  prefs.remove("portal_reason");
  prefs.end();
}

bool runConfigPortal(bool forcePortal, const String &reason) {
  loadDeviceConfig();

  char robotIdBuf[40];
  char baseTopicBuf[32];
  char mqttHostBuf[80];
  char mqttPortBuf[8];
  char mqttUserBuf[80];
  char mqttPassBuf[80];
  char telemetryMsBuf[12];

  strlcpy(robotIdBuf, cfg.robotId.c_str(), sizeof(robotIdBuf));
  strlcpy(baseTopicBuf, cfg.baseTopic.c_str(), sizeof(baseTopicBuf));
  strlcpy(mqttHostBuf, cfg.mqttHost.c_str(), sizeof(mqttHostBuf));
  snprintf(mqttPortBuf, sizeof(mqttPortBuf), "%u", cfg.mqttPort);
  strlcpy(mqttUserBuf, cfg.mqttUser.c_str(), sizeof(mqttUserBuf));
  strlcpy(mqttPassBuf, cfg.mqttPass.c_str(), sizeof(mqttPassBuf));
  snprintf(telemetryMsBuf, sizeof(telemetryMsBuf), "%lu", (unsigned long)cfg.telemetryIntervalMs);

  String deviceHtml =
    "<div style='padding:10px;border:1px solid #ccc;border-radius:8px;margin:8px 0;'>"
    "<b>VisionBot ESP32-CAM</b><br>"
    "Device ID: <b>" + deviceId + "</b><br>"
    "Setup AP: <b>" + setupApSsid + "</b><br>"
    "Firmware: <b>" + String(FW_VERSION) + "</b><br>"
    "Reason: <b>" + reason + "</b><br>"
    "Camera stream after Wi-Fi: <b>ws://&lt;device_ip&gt;:86/</b><br>"
    "MQTT: <b>plain MQTT external port 1884 for Docker Compose LAN demo</b><br>"
    "Default hotspot mode uses MQTT host <b>192.168.137.1</b>."
    "</div>";

  WiFiManagerParameter pDevice(deviceHtml.c_str());
  WiFiManagerParameter pRobotId("robot_id", "Robot ID / friendly name", robotIdBuf, sizeof(robotIdBuf));
  WiFiManagerParameter pBaseTopic("base_topic", "MQTT base topic", baseTopicBuf, sizeof(baseTopicBuf));
  WiFiManagerParameter pMqttHost("mqtt_host", "MQTT broker host/IP", mqttHostBuf, sizeof(mqttHostBuf));
  WiFiManagerParameter pMqttPort("mqtt_port", "MQTT broker port", mqttPortBuf, sizeof(mqttPortBuf));
  WiFiManagerParameter pMqttUser("mqtt_user", "MQTT username", mqttUserBuf, sizeof(mqttUserBuf));
  WiFiManagerParameter pMqttPass("mqtt_pass", "MQTT password", mqttPassBuf, sizeof(mqttPassBuf), "type='password'");
  WiFiManagerParameter pTelemetryMs("telemetry_ms", "Telemetry interval ms", telemetryMsBuf, sizeof(telemetryMsBuf));

  WiFiManager wm;
  wm.setTitle("VisionBot Setup");
  wm.setClass("invert");
  wm.setConfigPortalTimeout(300);
  wm.setConnectTimeout(30);
  wm.setDebugOutput(true);

  wm.addParameter(&pDevice);
  wm.addParameter(&pRobotId);
  wm.addParameter(&pBaseTopic);
  wm.addParameter(&pMqttHost);
  wm.addParameter(&pMqttPort);
  wm.addParameter(&pMqttUser);
  wm.addParameter(&pMqttPass);
  wm.addParameter(&pTelemetryMs);

  Serial.println();
  Serial.println("=== Wi-Fi / MQTT setup portal ===");
  Serial.print("Reason: ");
  Serial.println(reason);
  Serial.print("Mode: ");
  Serial.println(forcePortal ? "FORCED CONFIG PORTAL" : "AUTO CONNECT / PORTAL IF WI-FI FAILS");
  Serial.print("Device ID: ");
  Serial.println(deviceId);
  Serial.print("Setup AP SSID: ");
  Serial.println(setupApSsid);
  Serial.print("Setup AP password: ");
  Serial.println(setupApPass);
  Serial.print("Current MQTT host: ");
  Serial.println(cfg.mqttHost);
  Serial.println("If saved Wi-Fi fails, config portal opens automatically.");
  Serial.println("If MQTT fails 3 times consecutively, config portal opens automatically too.");

  bool connected;
  if (forcePortal) {
    motorStop();
    mqttClient.disconnect();
    connected = wm.startConfigPortal(setupApSsid.c_str(), setupApPass.c_str());
  } else {
    connected = wm.autoConnect(setupApSsid.c_str(), setupApPass.c_str());
  }

  if (!connected) {
    Serial.println("WiFiManager failed or timed out. Restarting...");
    delay(1000);
    ESP.restart();
    return false;
  }

  saveDeviceConfig(
    pRobotId.getValue(),
    pBaseTopic.getValue(),
    pMqttHost.getValue(),
    pMqttPort.getValue(),
    pMqttUser.getValue(),
    pMqttPass.getValue(),
    pTelemetryMs.getValue()
  );

  if (forcePortal) {
    clearRecoveryPortalReason();
  }

  WiFi.setSleep(false);
  Serial.println("Wi-Fi connected.");
  Serial.println("Wi-Fi sleep disabled for lower camera-stream latency.");
  Serial.print("IP: ");
  Serial.println(WiFi.localIP());

  if (forcePortal) {
    Serial.println("Config portal finished. Restarting to reload Wi-Fi/MQTT cleanly...");
    delay(1000);
    ESP.restart();
  }

  return true;
}

bool connectDemoHotspot() {
#if VISIONBOT_DEMO_WIFI_ENABLE
  Serial.println();
  Serial.println("=== Hardcoded laptop hotspot Wi-Fi ===");
  Serial.print("Trying SSID: ");
  Serial.println(VISIONBOT_DEMO_WIFI_SSID);
  Serial.print("MQTT broker default: ");
  Serial.print(VISIONBOT_DEMO_MQTT_HOST);
  Serial.print(":");
  Serial.println(VISIONBOT_DEMO_MQTT_PORT);

  WiFi.mode(WIFI_STA);
  WiFi.setSleep(false);
  WiFi.begin(VISIONBOT_DEMO_WIFI_SSID, VISIONBOT_DEMO_WIFI_PASS);

  unsigned long start = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - start < 45000) {
    Serial.print(".");
    delay(500);
  }
  Serial.println();

  if (WiFi.status() == WL_CONNECTED) {
    loadDeviceConfig();
    Serial.println("Hardcoded hotspot connected.");
    Serial.println("Wi-Fi sleep disabled for lower camera-stream latency.");
    Serial.print("IP: ");
    Serial.println(WiFi.localIP());
    return true;
  }

  Serial.println("Hardcoded hotspot not found. Falling back to setup portal.");
#endif
  return false;
}

bool startConfigPortalIfNeeded() {
  String recoveryReason = getRecoveryPortalReason();
  if (recoveryReason.length() > 0) {
    return runConfigPortal(true, recoveryReason);
  }
  if (connectDemoHotspot()) {
    return true;
  }
  return runConfigPortal(false, "boot");
}

void openConfigPortalForRecovery(const String &reason) {
  Serial.println();
  Serial.println("!!! Scheduling recovery config portal !!!");
  Serial.println("Reason: " + reason);
  Serial.println("Restarting into clean setup mode so WiFiManager can own port 80.");
  setRecoveryPortalReason(reason);
  motorStop();
  mqttClient.disconnect();
  delay(1000);
  ESP.restart();
}

void resetMqttFailureTracker() {
  mqttConsecutiveFailures = 0;
}

void recordMqttFailureAndMaybeOpenPortal() {
  mqttConsecutiveFailures++;

  Serial.print("MQTT consecutive failures: ");
  Serial.print(mqttConsecutiveFailures);
  Serial.print("/");
  Serial.println(MQTT_AUTO_PORTAL_FAIL_COUNT);

